# 6: Написать функцию, которая принимает в качестве аргумента список и возвращает в качестве результата список с
# уникальными отсортированными значениями в обратном порядке. П
# ример: [19, 12, 4, 12, 7, 9, 5, 8, 3, 17, 8, 19, 12, 3, 6, 15, 15, 16, 11, 13, 19, 16, 11, 12, 20, 2, 16, 7, 15, 2, 6, 15, 17, 15, 19, 4,
# 13, 14, 6, 5, 12, 2, 20, 7, 19, 4, 15, 16, 7, 20],
# результат: [20, 19, 17, 16, 15, 14, 13, 12, 11, 9, 8, 7, 6, 5, 4, 3, 2]

def workList (lst):
    l = set(lst)
    l = list(l)
    l.sort(reverse=True)
    return l

a =  [19, 12, 4, 12, 7, 9, 5, 8, 3, 17, 8, 19, 12, 3, 6, 15, 15, 16, 11, 13, 19, 16, 11, 12, 20, 2, 16, 7, 15, 2, 6, 15, 17, 15, 19, 4,
 13, 14, 6, 5, 12, 2, 20, 7, 19, 4, 15, 16, 7, 20]

print(workList(a))

